# TypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..TypeId Property
Subelement Class See Also
---
The identifier of this subelement's type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ElementId TypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
```

# Remarks
Some subelements cannot have type assigned, in which case this method returns invalid element id.
# See Also
Subelement Class
Autodesk.Revit.DB Namespace